Repository: Wiciaki/Opti
Catalog: Opti/Properties/Resources.*.resx
Languages: pl_pl

# description_open
source: If this flag is specified, the resulting directory will be open after the successful optimization
pl_pl: Kiedy ta opcja jest wybrana, folder zapisu zostanie na końcu ukazany użytkownikowi

# description_outdir
source: The path of the desired directory to contain the results. Doesn't have to exist beforehand
pl_pl: Ścieżka do zapisu plików wyjściowych. Jeśli wskazuje na nieistniejący folder, program go utworzy

# description_paths
source: Collection of paths being either directories containing the input files or the files themselves. It is expected that you provide .gsa, .txt and .mic files, one of each. Paths provided can be relative. If no paths are provided, current working directory will be used to retrieve the file paths
pl_pl: Zbiór ścieżek wskazujących na pliki wejściowe lub foldery zawierające te pliki. Oczekiwane jest, że w sumie zostanie wskazane po dokładnie 1 pliku .gsa, .txt, .mic. Program obsługuje poprawnie ścieżki relatywne. Jeśli żadna ścieżka nie zostanie podana, program spróbuje pobrać pliki wejściowe z obecnie aktywnego folderu

# description_print
source: If this flag is specified, the full result will be printed to the console
pl_pl: Kiedy ta opcja jest wybrana, program poza zapisem, wypisze też wynik w konsoli

# description_root
source: A tool that optimizes the ASM-formatted files; the amount of both operational and conditional vertices
pl_pl: Narzędzie optymalizujące pliki w formacie ASM pod kątem liczby wierzchołków operacyjnych i warunkowych

# description_verifyonly
source: If this flag is specified, the program will only report whether the input files are in the correct format; no optimization is done nor any output is produced. If this option is specified, all the other are ignored
pl_pl: Kiedy ta opcja zostanie podana, program zaraportuje tylko o poprawności zawartości plików wejściowych; żadne wyjście nie zostanie wygenerowane, a pozostałe opcje zostaną zignorowane

# elements_optimized
source: Optimized {0} elements
pl_pl: Zoptymalizowano {0} elementów

# err_input_invalid
source: No valid {0} file provided!
pl_pl: Nie znaleziono pliku {0}!

# err_input_mulltiple
source: Multiple {0} files found!
pl_pl: Znaleziono więcej niż jeden plik {0}!

# err_outdir_invalid
source: Outdir parameter not valid!
pl_pl: Folder wyjściowy podany w niepoprawnym formacie!

# input_err
source: Found incompatibilities during input analysis!
pl_pl: Znaleziono niekompatybilności podczas weryfikacji wejścia!

# input_ok
source: Input checked, appears to be fully valid!
pl_pl: Wejście zweryfikowane, wszystko OK!

# press_to_continue
source: Press any button to continue...
pl_pl: Wciśnij dowolny przycisk, aby kontynuować...
